<?php

$agentDirBase = "/var/www/html/calldb/agent/";

$headerArr = array(
'@',
'商品コード',
'業種ID',
'公開開始日',
'テンプレート',
'レイアウト',
'店舗管理ID',
'店舗ID',
'店舗名',
'店舗名（カタカナ）',
'郵便番号（前）',
'郵便番号（後）',
'都道府県',
'市区町村',
'町・字名',
'丁目・番地・号',
'ビル名',
'電話番号1',
'電話番号の補足説明1',
'電話番号2',
'電話番号の補足説明2',
'地図情報(緯度)',
'地図情報(経度)',
'プレイスページ名／チェーン店名称',
'ページタイトルの表示方法',
'ページタイトルの画像',
'ヘッダー画像の利用方法',
'ヘッダーの背景画像',
'営業時間',
'定休日',
'ブログタイトル',
'ブログＵＲＬ',
'PPC導通確認',
'広告の表示',
'クチコミの表示',
'著作権表示（コピーライト）',
'チェーンページ名',
'タイトル画像',
'キャッチコピー',
'紹介文',
'お知らせ本文1',
'お知らせリンクの設定1',
'お知らせ本文2',
'お知らせリンクの設定2',
'お知らせ本文3',
'お知らせリンクの設定3',
'お知らせ本文4',
'お知らせリンクの設定4',
'お知らせ本文5',
'お知らせリンクの設定5',
'トップページ名',
'タイトル画像',
'キャッチコピー',
'紹介文',
'店舗/施設紹介ページ公開/非公開',
'お店紹介ページ名',
'FAX番号',
'FAX補足説明',
'メールアドレス1',
'メールアドレス2',
'平均予算の料金 (from)1',
'平均予算の料金 (to)1',
'平均予算の予算のコメント1',
'平均予算の料金 (from)2',
'平均予算の料金 (to)2',
'平均予算の予算のコメント2',
'座席数',
'喫煙・禁煙の可否',
'喫煙・禁煙の補足説明',
'予約の可否',
'予約の補足説明',
'貸切の可否',
'貸切の補足説明',
'個室の有無',
'個室の補足説明',
'クレジットカード利用の可否',
'クレジットカードの種類',
'お知らせ本文1',
'お知らせリンクの設定1',
'お知らせ本文2',
'お知らせリンクの設定2',
'お知らせ本文3',
'お知らせリンクの設定3',
'お知らせ本文4',
'お知らせリンクの設定4',
'お知らせ本文5',
'お知らせリンクの設定5',
'WiFiサービス',
'WiFiサービス（その他）',
'パソコン向け公式サイト名',
'パソコン向け公式サイトURL',
'携帯電話向け公式サイト名',
'携帯電話向け公式トURL',
'備考',
'その他店舗/施設の情報',
'メニューページ名',
'メニュータブ公開/非公開',
'メニュータブ名',
'メニュータイプ1',
'メニュー1 / カテゴリ名1',
'検索用のメニュー分類ー1',
'メニュー画像1',
'メニュー紹介1 / カテゴリ紹介1',
'料金1',
'料金コメント1',
'おすすめ商品の設定1',
'メニュータイプ2',
'メニュー2 / カテゴリ名2',
'検索用のメニュー分類ー2',
'メニュー画像2',
'メニュー紹介2 / カテゴリ紹介2',
'料金2',
'料金コメント2',
'おすすめ商品の設定2',
'メニュータイプ3',
'メニュー3/ カテゴリ名3',
'検索用のメニュー分類ー3',
'メニュー画像3',
'メニュー紹介3 / カテゴリ紹介3',
'料金3',
'料金コメント3',
'おすすめ商品の設定3',
'メニュータイプ4',
'メニュー4 / カテゴリ名4',
'検索用のメニュー分類ー4',
'メニュー画像4',
'メニュー紹介4 / カテゴリ紹介4',
'料金4',
'料金コメント4',
'おすすめ商品の設定4',
'メニュータイプ5',
'メニュー5 / カテゴリ名5',
'検索用のメニュー分類ー5',
'メニュー画像5',
'メニュー紹介5 / カテゴリ紹介5',
'料金5',
'料金コメント5',
'おすすめ商品の設定5',
'メニュータイプ6',
'メニュー6 / カテゴリ名6',
'検索用のメニュー分類ー6',
'メニュー画像6',
'メニュー紹介6 / カテゴリ紹介6',
'料金6',
'料金コメント6',
'おすすめ商品の設定6',
'メニュータイプ7',
'メニュー7 / カテゴリ名7',
'検索用のメニュー分類ー7',
'メニュー画像7',
'メニュー紹介7 / カテゴリ紹介7',
'料金7',
'料金コメント7',
'おすすめ商品の設定7',
'メニュータイプ8',
'メニュー8 / カテゴリ名8',
'検索用のメニュー分類ー8',
'メニュー画像8',
'メニュー紹介8 / カテゴリ紹介8',
'料金8',
'料金コメント8',
'おすすめ商品の設定8',
'メニュータイプ9',
'メニュー9 / カテゴリ名9',
'検索用のメニュー分類ー9',
'メニュー画像9',
'メニュー紹介9 / カテゴリ紹介9',
'料金9',
'料金コメント9',
'おすすめ商品の設定9',
'メニュータイプ10',
'メニュー10 / カテゴリ名10',
'検索用のメニュー分類ー10',
'メニュー画像10',
'メニュー紹介10 / カテゴリ紹介10',
'料金10',
'料金コメント10',
'おすすめ商品の設定10',
'メニュータイプ11',
'メニュー11 / カテゴリ名11',
'検索用のメニュー分類ー11',
'メニュー画像11',
'メニュー紹介11 / カテゴリ紹介11',
'料金11',
'料金コメント11',
'おすすめ商品の設定11',
'メニュータイプ12',
'メニュー12 / カテゴリ名12',
'検索用のメニュー分類ー12',
'メニュー画像12',
'メニュー紹介12 / カテゴリ紹介12',
'料金12',
'料金コメント12',
'おすすめ商品の設定12',
'メニュータイプ13',
'メニュー13 / カテゴリ名13',
'検索用のメニュー分類ー13',
'メニュー画像13',
'メニュー紹介13 / カテゴリ紹介13',
'料金13',
'料金コメント13',
'おすすめ商品の設定13',
'メニュータイプ14',
'メニュー14 / カテゴリ名14',
'検索用のメニュー分類ー14',
'メニュー画像14',
'メニュー紹介14 / カテゴリ紹介14',
'料金14',
'料金コメント14',
'おすすめ商品の設定14',
'メニュータイプ15',
'メニュー15 / カテゴリ名15',
'検索用のメニュー分類ー15',
'メニュー画像15',
'メニュー紹介15 / カテゴリ紹介15',
'料金15',
'料金コメント15',
'おすすめ商品の設定15',
'メニュータイプ16',
'メニュー16 / カテゴリ名16',
'検索用のメニュー分類ー16',
'メニュー画像16',
'メニュー紹介16 / カテゴリ紹介16',
'料金16',
'料金コメント16',
'おすすめ商品の設定16',
'メニュータイプ17',
'メニュー17 / カテゴリ名17',
'検索用のメニュー分類ー17',
'メニュー画像17',
'メニュー紹介17 / カテゴリ紹介17',
'料金17',
'料金コメント17',
'おすすめ商品の設定17',
'メニュータイプ18',
'メニュー18 / カテゴリ名18',
'検索用のメニュー分類ー18',
'メニュー画像18',
'メニュー紹介18 / カテゴリ紹介18',
'料金18',
'料金コメント18',
'おすすめ商品の設定18',
'メニュータイプ19',
'メニュー19 / カテゴリ名19',
'検索用のメニュー分類ー19',
'メニュー画像19',
'メニュー紹介19 / カテゴリ紹介19',
'料金19',
'料金コメント19',
'おすすめ商品の設定19',
'メニュータイプ20',
'メニュー20 / カテゴリ名20',
'検索用のメニュー分類ー20',
'メニュー画像20',
'メニュー紹介20 / カテゴリ紹介20',
'料金20',
'料金コメント20',
'おすすめ商品の設定20',
'メニュータイプ21',
'メニュー21 / カテゴリ名21',
'検索用のメニュー分類ー21',
'メニュー画像21',
'メニュー紹介21 / カテゴリ紹介21',
'料金21',
'料金コメント21',
'おすすめ商品の設定21',
'メニュータイプ22',
'メニュー22 / カテゴリ名22',
'検索用のメニュー分類ー22',
'メニュー画像22',
'メニュー紹介22 / カテゴリ紹介22',
'料金22',
'料金コメント22',
'おすすめ商品の設定22',
'メニュータイプ23',
'メニュー23 / カテゴリ名23',
'検索用のメニュー分類ー23',
'メニュー画像23',
'メニュー紹介23 / カテゴリ紹介23',
'料金23',
'料金コメント23',
'おすすめ商品の設定23',
'メニュータイプ24',
'メニュー24 / カテゴリ名24',
'検索用のメニュー分類ー24',
'メニュー画像24',
'メニュー紹介24 / カテゴリ紹介24',
'料金24',
'料金コメント24',
'おすすめ商品の設定24',
'メニュータイプ25',
'メニュー25 / カテゴリ名25',
'検索用のメニュー分類ー25',
'メニュー画像25',
'メニュー紹介25 / カテゴリ紹介25',
'料金25',
'料金コメント25',
'おすすめ商品の設定25',
'メニュータイプ26',
'メニュー26 / カテゴリ名26',
'検索用のメニュー分類ー26',
'メニュー画像26',
'メニュー紹介26 / カテゴリ紹介26',
'料金26',
'料金コメント26',
'おすすめ商品の設定26',
'メニュータイプ27',
'メニュー27 / カテゴリ名27',
'検索用のメニュー分類ー27',
'メニュー画像27',
'メニュー紹介27 / カテゴリ紹介27',
'料金27',
'料金コメント27',
'おすすめ商品の設定27',
'メニュータイプ28',
'メニュー28 / カテゴリ名28',
'検索用のメニュー分類ー28',
'メニュー画像28',
'メニュー紹介28 / カテゴリ紹介28',
'料金28',
'料金コメント28',
'おすすめ商品の設定28',
'メニュータイプ29',
'メニュー29 / カテゴリ名29',
'検索用のメニュー分類ー29',
'メニュー画像29',
'メニュー紹介29 / カテゴリ紹介29',
'料金29',
'料金コメント29',
'おすすめ商品の設定29',
'メニュータイプ30',
'メニュー30 / カテゴリ名30',
'検索用のメニュー分類ー30',
'メニュー画像30',
'メニュー紹介30 / カテゴリ紹介30',
'料金30',
'料金コメント30',
'おすすめ商品の設定30',
'メニュータイプ31',
'メニュー31 / カテゴリ名31',
'検索用のメニュー分類ー31',
'メニュー画像31',
'メニュー紹介31 / カテゴリ紹介31',
'料金31',
'料金コメント31',
'おすすめ商品の設定31',
'メニュータイプ32',
'メニュー32 / カテゴリ名32',
'検索用のメニュー分類ー32',
'メニュー画像32',
'メニュー紹介32 / カテゴリ紹介32',
'料金32',
'料金コメント32',
'おすすめ商品の設定32',
'メニュータイプ33',
'メニュー33 / カテゴリ名33',
'検索用のメニュー分類ー33',
'メニュー画像33',
'メニュー紹介33 / カテゴリ紹介33',
'料金33',
'料金コメント33',
'おすすめ商品の設定33',
'メニュータイプ34',
'メニュー34 / カテゴリ名34',
'検索用のメニュー分類ー34',
'メニュー画像34',
'メニュー紹介34 / カテゴリ紹介34',
'料金34',
'料金コメント34',
'おすすめ商品の設定34',
'メニュータイプ35',
'メニュー35 / カテゴリ名35',
'検索用のメニュー分類ー35',
'メニュー画像35',
'メニュー紹介35 / カテゴリ紹介35',
'料金35',
'料金コメント35',
'おすすめ商品の設定35',
'メニュータイプ36',
'メニュー36 / カテゴリ名36',
'検索用のメニュー分類ー36',
'メニュー画像36',
'メニュー紹介36 / カテゴリ紹介36',
'料金36',
'料金コメント36',
'おすすめ商品の設定36',
'メニュータイプ37',
'メニュー37 / カテゴリ名37',
'検索用のメニュー分類ー37',
'メニュー画像37',
'メニュー紹介37 / カテゴリ紹介37',
'料金37',
'料金コメント37',
'おすすめ商品の設定37',
'メニュータイプ38',
'メニュー38 / カテゴリ名38',
'検索用のメニュー分類ー38',
'メニュー画像38',
'メニュー紹介38 / カテゴリ紹介38',
'料金38',
'料金コメント38',
'おすすめ商品の設定38',
'メニュータイプ39',
'メニュー39 / カテゴリ名39',
'検索用のメニュー分類ー39',
'メニュー画像39',
'メニュー紹介39 / カテゴリ紹介39',
'料金39',
'料金コメント39',
'おすすめ商品の設定39',
'メニュータイプ40',
'メニュー40 / カテゴリ名40',
'検索用のメニュー分類ー40',
'メニュー画像40',
'メニュー紹介40 / カテゴリ紹介40',
'料金40',
'料金コメント40',
'おすすめ商品の設定40',
'メニュータブ公開/非公開',
'メニュータブ名',
'メニュータイプ1',
'メニュー1 / カテゴリ名1',
'検索用のメニュー分類ー1',
'メニュー画像1',
'メニュー紹介1 / カテゴリ紹介1',
'料金1',
'料金コメント1',
'おすすめ商品の設定1',
'メニュータイプ2',
'メニュー2 / カテゴリ名2',
'検索用のメニュー分類ー2',
'メニュー画像2',
'メニュー紹介2 / カテゴリ紹介2',
'料金2',
'料金コメント2',
'おすすめ商品の設定2',
'メニュータイプ3',
'メニュー3/ カテゴリ名3',
'検索用のメニュー分類ー3',
'メニュー画像3',
'メニュー紹介3 / カテゴリ紹介3',
'料金3',
'料金コメント3',
'おすすめ商品の設定3',
'メニュータイプ4',
'メニュー4 / カテゴリ名4',
'検索用のメニュー分類ー4',
'メニュー画像4',
'メニュー紹介4 / カテゴリ紹介4',
'料金4',
'料金コメント4',
'おすすめ商品の設定4',
'メニュータイプ5',
'メニュー5 / カテゴリ名5',
'検索用のメニュー分類ー5',
'メニュー画像5',
'メニュー紹介5 / カテゴリ紹介5',
'料金5',
'料金コメント5',
'おすすめ商品の設定5',
'メニュータイプ6',
'メニュー6 / カテゴリ名6',
'検索用のメニュー分類ー6',
'メニュー画像6',
'メニュー紹介6 / カテゴリ紹介6',
'料金6',
'料金コメント6',
'おすすめ商品の設定6',
'メニュータイプ7',
'メニュー7 / カテゴリ名7',
'検索用のメニュー分類ー7',
'メニュー画像7',
'メニュー紹介7 / カテゴリ紹介7',
'料金7',
'料金コメント7',
'おすすめ商品の設定7',
'メニュータイプ8',
'メニュー8 / カテゴリ名8',
'検索用のメニュー分類ー8',
'メニュー画像8',
'メニュー紹介8 / カテゴリ紹介8',
'料金8',
'料金コメント8',
'おすすめ商品の設定8',
'メニュータイプ9',
'メニュー9 / カテゴリ名9',
'検索用のメニュー分類ー9',
'メニュー画像9',
'メニュー紹介9 / カテゴリ紹介9',
'料金9',
'料金コメント9',
'おすすめ商品の設定9',
'メニュータイプ10',
'メニュー10 / カテゴリ名10',
'検索用のメニュー分類ー10',
'メニュー画像10',
'メニュー紹介10 / カテゴリ紹介10',
'料金10',
'料金コメント10',
'おすすめ商品の設定10',
'メニュータイプ11',
'メニュー11 / カテゴリ名11',
'検索用のメニュー分類ー11',
'メニュー画像11',
'メニュー紹介11 / カテゴリ紹介11',
'料金11',
'料金コメント11',
'おすすめ商品の設定11',
'メニュータイプ12',
'メニュー12 / カテゴリ名12',
'検索用のメニュー分類ー12',
'メニュー画像12',
'メニュー紹介12 / カテゴリ紹介12',
'料金12',
'料金コメント12',
'おすすめ商品の設定12',
'メニュータイプ13',
'メニュー13 / カテゴリ名13',
'検索用のメニュー分類ー13',
'メニュー画像13',
'メニュー紹介13 / カテゴリ紹介13',
'料金13',
'料金コメント13',
'おすすめ商品の設定13',
'メニュータイプ14',
'メニュー14 / カテゴリ名14',
'検索用のメニュー分類ー14',
'メニュー画像14',
'メニュー紹介14 / カテゴリ紹介14',
'料金14',
'料金コメント14',
'おすすめ商品の設定14',
'メニュータイプ15',
'メニュー15 / カテゴリ名15',
'検索用のメニュー分類ー15',
'メニュー画像15',
'メニュー紹介15 / カテゴリ紹介15',
'料金15',
'料金コメント15',
'おすすめ商品の設定15',
'メニュータイプ16',
'メニュー16 / カテゴリ名16',
'検索用のメニュー分類ー16',
'メニュー画像16',
'メニュー紹介16 / カテゴリ紹介16',
'料金16',
'料金コメント16',
'おすすめ商品の設定16',
'メニュータイプ17',
'メニュー17 / カテゴリ名17',
'検索用のメニュー分類ー17',
'メニュー画像17',
'メニュー紹介17 / カテゴリ紹介17',
'料金17',
'料金コメント17',
'おすすめ商品の設定17',
'メニュータイプ18',
'メニュー18 / カテゴリ名18',
'検索用のメニュー分類ー18',
'メニュー画像18',
'メニュー紹介18 / カテゴリ紹介18',
'料金18',
'料金コメント18',
'おすすめ商品の設定18',
'メニュータイプ19',
'メニュー19 / カテゴリ名19',
'検索用のメニュー分類ー19',
'メニュー画像19',
'メニュー紹介19 / カテゴリ紹介19',
'料金19',
'料金コメント19',
'おすすめ商品の設定19',
'メニュータイプ20',
'メニュー20 / カテゴリ名20',
'検索用のメニュー分類ー20',
'メニュー画像20',
'メニュー紹介20 / カテゴリ紹介20',
'料金20',
'料金コメント20',
'おすすめ商品の設定20',
'メニュータイプ21',
'メニュー21 / カテゴリ名21',
'検索用のメニュー分類ー21',
'メニュー画像21',
'メニュー紹介21 / カテゴリ紹介21',
'料金21',
'料金コメント21',
'おすすめ商品の設定21',
'メニュータイプ22',
'メニュー22 / カテゴリ名22',
'検索用のメニュー分類ー22',
'メニュー画像22',
'メニュー紹介22 / カテゴリ紹介22',
'料金22',
'料金コメント22',
'おすすめ商品の設定22',
'メニュータイプ23',
'メニュー23 / カテゴリ名23',
'検索用のメニュー分類ー23',
'メニュー画像23',
'メニュー紹介23 / カテゴリ紹介23',
'料金23',
'料金コメント23',
'おすすめ商品の設定23',
'メニュータイプ24',
'メニュー24 / カテゴリ名24',
'検索用のメニュー分類ー24',
'メニュー画像24',
'メニュー紹介24 / カテゴリ紹介24',
'料金24',
'料金コメント24',
'おすすめ商品の設定24',
'メニュータイプ25',
'メニュー25 / カテゴリ名25',
'検索用のメニュー分類ー25',
'メニュー画像25',
'メニュー紹介25 / カテゴリ紹介25',
'料金25',
'料金コメント25',
'おすすめ商品の設定25',
'メニュータイプ26',
'メニュー26 / カテゴリ名26',
'検索用のメニュー分類ー26',
'メニュー画像26',
'メニュー紹介26 / カテゴリ紹介26',
'料金26',
'料金コメント26',
'おすすめ商品の設定26',
'メニュータイプ27',
'メニュー27 / カテゴリ名27',
'検索用のメニュー分類ー27',
'メニュー画像27',
'メニュー紹介27 / カテゴリ紹介27',
'料金27',
'料金コメント27',
'おすすめ商品の設定27',
'メニュータイプ28',
'メニュー28 / カテゴリ名28',
'検索用のメニュー分類ー28',
'メニュー画像28',
'メニュー紹介28 / カテゴリ紹介28',
'料金28',
'料金コメント28',
'おすすめ商品の設定28',
'メニュータイプ29',
'メニュー29 / カテゴリ名29',
'検索用のメニュー分類ー29',
'メニュー画像29',
'メニュー紹介29 / カテゴリ紹介29',
'料金29',
'料金コメント29',
'おすすめ商品の設定29',
'メニュータイプ30',
'メニュー30 / カテゴリ名30',
'検索用のメニュー分類ー30',
'メニュー画像30',
'メニュー紹介30 / カテゴリ紹介30',
'料金30',
'料金コメント30',
'おすすめ商品の設定30',
'メニュータイプ31',
'メニュー31 / カテゴリ名31',
'検索用のメニュー分類ー31',
'メニュー画像31',
'メニュー紹介31 / カテゴリ紹介31',
'料金31',
'料金コメント31',
'おすすめ商品の設定31',
'メニュータイプ32',
'メニュー32 / カテゴリ名32',
'検索用のメニュー分類ー32',
'メニュー画像32',
'メニュー紹介32 / カテゴリ紹介32',
'料金32',
'料金コメント32',
'おすすめ商品の設定32',
'メニュータイプ33',
'メニュー33 / カテゴリ名33',
'検索用のメニュー分類ー33',
'メニュー画像33',
'メニュー紹介33 / カテゴリ紹介33',
'料金33',
'料金コメント33',
'おすすめ商品の設定33',
'メニュータイプ34',
'メニュー34 / カテゴリ名34',
'検索用のメニュー分類ー34',
'メニュー画像34',
'メニュー紹介34 / カテゴリ紹介34',
'料金34',
'料金コメント34',
'おすすめ商品の設定34',
'メニュータイプ35',
'メニュー35 / カテゴリ名35',
'検索用のメニュー分類ー35',
'メニュー画像35',
'メニュー紹介35 / カテゴリ紹介35',
'料金35',
'料金コメント35',
'おすすめ商品の設定35',
'メニュータイプ36',
'メニュー36 / カテゴリ名36',
'検索用のメニュー分類ー36',
'メニュー画像36',
'メニュー紹介36 / カテゴリ紹介36',
'料金36',
'料金コメント36',
'おすすめ商品の設定36',
'メニュータイプ37',
'メニュー37 / カテゴリ名37',
'検索用のメニュー分類ー37',
'メニュー画像37',
'メニュー紹介37 / カテゴリ紹介37',
'料金37',
'料金コメント37',
'おすすめ商品の設定37',
'メニュータイプ38',
'メニュー38 / カテゴリ名38',
'検索用のメニュー分類ー38',
'メニュー画像38',
'メニュー紹介38 / カテゴリ紹介38',
'料金38',
'料金コメント38',
'おすすめ商品の設定38',
'メニュータイプ39',
'メニュー39 / カテゴリ名39',
'検索用のメニュー分類ー39',
'メニュー画像39',
'メニュー紹介39 / カテゴリ紹介39',
'料金39',
'料金コメント39',
'おすすめ商品の設定39',
'メニュータイプ40',
'メニュー40 / カテゴリ名40',
'検索用のメニュー分類ー40',
'メニュー画像40',
'メニュー紹介40 / カテゴリ紹介40',
'料金40',
'料金コメント40',
'おすすめ商品の設定40',
'メニュータブ公開/非公開',
'メニュータブ名',
'メニュータイプ1',
'メニュー1 / カテゴリ名1',
'検索用のメニュー分類ー1',
'メニュー画像1',
'メニュー紹介1 / カテゴリ紹介1',
'料金1',
'料金コメント1',
'おすすめ商品の設定1',
'メニュータイプ2',
'メニュー2 / カテゴリ名2',
'検索用のメニュー分類ー2',
'メニュー画像2',
'メニュー紹介2 / カテゴリ紹介2',
'料金2',
'料金コメント2',
'おすすめ商品の設定2',
'メニュータイプ3',
'メニュー3/ カテゴリ名3',
'検索用のメニュー分類ー3',
'メニュー画像3',
'メニュー紹介3 / カテゴリ紹介3',
'料金3',
'料金コメント3',
'おすすめ商品の設定3',
'メニュータイプ4',
'メニュー4 / カテゴリ名4',
'検索用のメニュー分類ー4',
'メニュー画像4',
'メニュー紹介4 / カテゴリ紹介4',
'料金4',
'料金コメント4',
'おすすめ商品の設定4',
'メニュータイプ5',
'メニュー5 / カテゴリ名5',
'検索用のメニュー分類ー5',
'メニュー画像5',
'メニュー紹介5 / カテゴリ紹介5',
'料金5',
'料金コメント5',
'おすすめ商品の設定5',
'メニュータイプ6',
'メニュー6 / カテゴリ名6',
'検索用のメニュー分類ー6',
'メニュー画像6',
'メニュー紹介6 / カテゴリ紹介6',
'料金6',
'料金コメント6',
'おすすめ商品の設定6',
'メニュータイプ7',
'メニュー7 / カテゴリ名7',
'検索用のメニュー分類ー7',
'メニュー画像7',
'メニュー紹介7 / カテゴリ紹介7',
'料金7',
'料金コメント7',
'おすすめ商品の設定7',
'メニュータイプ8',
'メニュー8 / カテゴリ名8',
'検索用のメニュー分類ー8',
'メニュー画像8',
'メニュー紹介8 / カテゴリ紹介8',
'料金8',
'料金コメント8',
'おすすめ商品の設定8',
'メニュータイプ9',
'メニュー9 / カテゴリ名9',
'検索用のメニュー分類ー9',
'メニュー画像9',
'メニュー紹介9 / カテゴリ紹介9',
'料金9',
'料金コメント9',
'おすすめ商品の設定9',
'メニュータイプ10',
'メニュー10 / カテゴリ名10',
'検索用のメニュー分類ー10',
'メニュー画像10',
'メニュー紹介10 / カテゴリ紹介10',
'料金10',
'料金コメント10',
'おすすめ商品の設定10',
'メニュータイプ11',
'メニュー11 / カテゴリ名11',
'検索用のメニュー分類ー11',
'メニュー画像11',
'メニュー紹介11 / カテゴリ紹介11',
'料金11',
'料金コメント11',
'おすすめ商品の設定11',
'メニュータイプ12',
'メニュー12 / カテゴリ名12',
'検索用のメニュー分類ー12',
'メニュー画像12',
'メニュー紹介12 / カテゴリ紹介12',
'料金12',
'料金コメント12',
'おすすめ商品の設定12',
'メニュータイプ13',
'メニュー13 / カテゴリ名13',
'検索用のメニュー分類ー13',
'メニュー画像13',
'メニュー紹介13 / カテゴリ紹介13',
'料金13',
'料金コメント13',
'おすすめ商品の設定13',
'メニュータイプ14',
'メニュー14 / カテゴリ名14',
'検索用のメニュー分類ー14',
'メニュー画像14',
'メニュー紹介14 / カテゴリ紹介14',
'料金14',
'料金コメント14',
'おすすめ商品の設定14',
'メニュータイプ15',
'メニュー15 / カテゴリ名15',
'検索用のメニュー分類ー15',
'メニュー画像15',
'メニュー紹介15 / カテゴリ紹介15',
'料金15',
'料金コメント15',
'おすすめ商品の設定15',
'メニュータイプ16',
'メニュー16 / カテゴリ名16',
'検索用のメニュー分類ー16',
'メニュー画像16',
'メニュー紹介16 / カテゴリ紹介16',
'料金16',
'料金コメント16',
'おすすめ商品の設定16',
'メニュータイプ17',
'メニュー17 / カテゴリ名17',
'検索用のメニュー分類ー17',
'メニュー画像17',
'メニュー紹介17 / カテゴリ紹介17',
'料金17',
'料金コメント17',
'おすすめ商品の設定17',
'メニュータイプ18',
'メニュー18 / カテゴリ名18',
'検索用のメニュー分類ー18',
'メニュー画像18',
'メニュー紹介18 / カテゴリ紹介18',
'料金18',
'料金コメント18',
'おすすめ商品の設定18',
'メニュータイプ19',
'メニュー19 / カテゴリ名19',
'検索用のメニュー分類ー19',
'メニュー画像19',
'メニュー紹介19 / カテゴリ紹介19',
'料金19',
'料金コメント19',
'おすすめ商品の設定19',
'メニュータイプ20',
'メニュー20 / カテゴリ名20',
'検索用のメニュー分類ー20',
'メニュー画像20',
'メニュー紹介20 / カテゴリ紹介20',
'料金20',
'料金コメント20',
'おすすめ商品の設定20',
'メニュータイプ21',
'メニュー21 / カテゴリ名21',
'検索用のメニュー分類ー21',
'メニュー画像21',
'メニュー紹介21 / カテゴリ紹介21',
'料金21',
'料金コメント21',
'おすすめ商品の設定21',
'メニュータイプ22',
'メニュー22 / カテゴリ名22',
'検索用のメニュー分類ー22',
'メニュー画像22',
'メニュー紹介22 / カテゴリ紹介22',
'料金22',
'料金コメント22',
'おすすめ商品の設定22',
'メニュータイプ23',
'メニュー23 / カテゴリ名23',
'検索用のメニュー分類ー23',
'メニュー画像23',
'メニュー紹介23 / カテゴリ紹介23',
'料金23',
'料金コメント23',
'おすすめ商品の設定23',
'メニュータイプ24',
'メニュー24 / カテゴリ名24',
'検索用のメニュー分類ー24',
'メニュー画像24',
'メニュー紹介24 / カテゴリ紹介24',
'料金24',
'料金コメント24',
'おすすめ商品の設定24',
'メニュータイプ25',
'メニュー25 / カテゴリ名25',
'検索用のメニュー分類ー25',
'メニュー画像25',
'メニュー紹介25 / カテゴリ紹介25',
'料金25',
'料金コメント25',
'おすすめ商品の設定25',
'メニュータイプ26',
'メニュー26 / カテゴリ名26',
'検索用のメニュー分類ー26',
'メニュー画像26',
'メニュー紹介26 / カテゴリ紹介26',
'料金26',
'料金コメント26',
'おすすめ商品の設定26',
'メニュータイプ27',
'メニュー27 / カテゴリ名27',
'検索用のメニュー分類ー27',
'メニュー画像27',
'メニュー紹介27 / カテゴリ紹介27',
'料金27',
'料金コメント27',
'おすすめ商品の設定27',
'メニュータイプ28',
'メニュー28 / カテゴリ名28',
'検索用のメニュー分類ー28',
'メニュー画像28',
'メニュー紹介28 / カテゴリ紹介28',
'料金28',
'料金コメント28',
'おすすめ商品の設定28',
'メニュータイプ29',
'メニュー29 / カテゴリ名29',
'検索用のメニュー分類ー29',
'メニュー画像29',
'メニュー紹介29 / カテゴリ紹介29',
'料金29',
'料金コメント29',
'おすすめ商品の設定29',
'メニュータイプ30',
'メニュー30 / カテゴリ名30',
'検索用のメニュー分類ー30',
'メニュー画像30',
'メニュー紹介30 / カテゴリ紹介30',
'料金30',
'料金コメント30',
'おすすめ商品の設定30',
'メニュータイプ31',
'メニュー31 / カテゴリ名31',
'検索用のメニュー分類ー31',
'メニュー画像31',
'メニュー紹介31 / カテゴリ紹介31',
'料金31',
'料金コメント31',
'おすすめ商品の設定31',
'メニュータイプ32',
'メニュー32 / カテゴリ名32',
'検索用のメニュー分類ー32',
'メニュー画像32',
'メニュー紹介32 / カテゴリ紹介32',
'料金32',
'料金コメント32',
'おすすめ商品の設定32',
'メニュータイプ33',
'メニュー33 / カテゴリ名33',
'検索用のメニュー分類ー33',
'メニュー画像33',
'メニュー紹介33 / カテゴリ紹介33',
'料金33',
'料金コメント33',
'おすすめ商品の設定33',
'メニュータイプ34',
'メニュー34 / カテゴリ名34',
'検索用のメニュー分類ー34',
'メニュー画像34',
'メニュー紹介34 / カテゴリ紹介34',
'料金34',
'料金コメント34',
'おすすめ商品の設定34',
'メニュータイプ35',
'メニュー35 / カテゴリ名35',
'検索用のメニュー分類ー35',
'メニュー画像35',
'メニュー紹介35 / カテゴリ紹介35',
'料金35',
'料金コメント35',
'おすすめ商品の設定35',
'メニュータイプ36',
'メニュー36 / カテゴリ名36',
'検索用のメニュー分類ー36',
'メニュー画像36',
'メニュー紹介36 / カテゴリ紹介36',
'料金36',
'料金コメント36',
'おすすめ商品の設定36',
'メニュータイプ37',
'メニュー37 / カテゴリ名37',
'検索用のメニュー分類ー37',
'メニュー画像37',
'メニュー紹介37 / カテゴリ紹介37',
'料金37',
'料金コメント37',
'おすすめ商品の設定37',
'メニュータイプ38',
'メニュー38 / カテゴリ名38',
'検索用のメニュー分類ー38',
'メニュー画像38',
'メニュー紹介38 / カテゴリ紹介38',
'料金38',
'料金コメント38',
'おすすめ商品の設定38',
'メニュータイプ39',
'メニュー39 / カテゴリ名39',
'検索用のメニュー分類ー39',
'メニュー画像39',
'メニュー紹介39 / カテゴリ紹介39',
'料金39',
'料金コメント39',
'おすすめ商品の設定39',
'メニュータイプ40',
'メニュー40 / カテゴリ名40',
'検索用のメニュー分類ー40',
'メニュー画像40',
'メニュー紹介40 / カテゴリ紹介40',
'料金40',
'料金コメント40',
'おすすめ商品の設定40',
'コースタブ公開/非公開',
'コースタブ名',
'コースタイプ1',
'コース名1 / カテゴリ名1',
'コース概要1 / カテゴリ紹介1',
'コース画像1',
'コース詳細1',
'食べ放題メニューに設定1',
'おすすめコースの設定1',
'コース料金1',
'コース料金の説明1',
'飲み放題付きコース料金1',
'飲み放題付きコース料金の説明1',
'コースタイプ2',
'コース名2 / カテゴリ名2',
'コース概要2 / カテゴリ紹介2',
'コース画像2',
'コース詳細2',
'食べ放題メニューに設定2',
'おすすめコースの設定2',
'コース料金2',
'コース料金の説明2',
'飲み放題付きコース料金2',
'飲み放題付きコース料金の説明2',
'コースタイプ3',
'コース名3 / カテゴリ名3',
'コース概要3 / カテゴリ紹介3',
'コース画像3',
'コース詳細3',
'食べ放題メニューに設定3',
'おすすめコースの設定3',
'コース料金3',
'コース料金の説明3',
'飲み放題付きコース料金3',
'飲み放題付きコース料金の説明3',
'コースタイプ4',
'コース名4 / カテゴリ名4',
'コース概要4 / カテゴリ紹介4',
'コース画像4',
'コース詳細4',
'食べ放題メニューに設定4',
'おすすめコースの設定4',
'コース料金4',
'コース料金の説明4',
'飲み放題付きコース料金4',
'飲み放題付きコース料金の説明4',
'コースタイプ5',
'コース名5 / カテゴリ名5',
'コース概要5 / カテゴリ紹介5',
'コース画像5',
'コース詳細5',
'食べ放題メニューに設定5',
'おすすめコースの設定5',
'コース料金5',
'コース料金の説明5',
'飲み放題付きコース料金5',
'飲み放題付きコース料金の説明5',
'コースタイプ6',
'コース名6 / カテゴリ名6',
'コース概要6 / カテゴリ紹介6',
'コース画像6',
'コース詳細6',
'食べ放題メニューに設定6',
'おすすめコースの設定6',
'コース料金6',
'コース料金の説明6',
'飲み放題付きコース料金6',
'飲み放題付きコース料金の説明6',
'飲み放題1',
'飲み放題2',
'コース注釈',
'商品ページ公開/非公開',
'商品ページ名',
'商品タイプ1',
'商品名1 / カテゴリ名1',
'商品紹介1/ カテゴリ紹介1',
'商品画像1-1',
'商品画像1-2',
'商品画像1-3',
'商品画像1-4',
'商品画像1-5',
'価格1',
'価格コメント1',
'おすすめ商品の設定1',
'商品タイプ2',
'商品名2 / カテゴリ名2',
'商品紹介2/ カテゴリ紹介2',
'商品画像2-1',
'商品画像2-2',
'商品画像2-3',
'商品画像2-4',
'商品画像2-5',
'価格2',
'価格コメント2',
'おすすめ商品の設定2',
'商品タイプ3',
'商品名3 / カテゴリ名3',
'商品紹介3/ カテゴリ紹介3',
'商品画像3-1',
'商品画像3-2',
'商品画像3-3',
'商品画像3-4',
'商品画像3-5',
'価格3',
'価格コメント3',
'おすすめ商品の設定3',
'商品タイプ4',
'商品名4 / カテゴリ名4',
'商品紹介4/ カテゴリ紹介4',
'商品画像4-1',
'商品画像4-2',
'商品画像4-3',
'商品画像4-4',
'商品画像4-5',
'価格4',
'価格コメント4',
'おすすめ商品の設定4',
'商品タイプ5',
'商品名5 / カテゴリ名5',
'商品紹介5/ カテゴリ紹介5',
'商品画像5-1',
'商品画像5-2',
'商品画像5-3',
'商品画像5-4',
'商品画像5-5',
'価格5',
'価格コメント5',
'おすすめ商品の設定5',
'商品タイプ6',
'商品名6 / カテゴリ名6',
'商品紹介6/ カテゴリ紹介6',
'商品画像6-1',
'商品画像6-2',
'商品画像6-3',
'商品画像6-4',
'商品画像6-5',
'価格6',
'価格コメント6',
'おすすめ商品の設定6',
'商品タイプ7',
'商品名7 / カテゴリ名7',
'商品紹介7/ カテゴリ紹介7',
'商品画像7-1',
'商品画像7-2',
'商品画像7-3',
'商品画像7-4',
'商品画像7-5',
'価格7',
'価格コメント7',
'おすすめ商品の設定7',
'商品タイプ8',
'商品名8 / カテゴリ名8',
'商品紹介8/ カテゴリ紹介8',
'商品画像8-1',
'商品画像8-2',
'商品画像8-3',
'商品画像8-4',
'商品画像8-5',
'価格8',
'価格コメント8',
'おすすめ商品の設定8',
'商品タイプ9',
'商品名9 / カテゴリ名9',
'商品紹介9/ カテゴリ紹介9',
'商品画像9-1',
'商品画像9-2',
'商品画像9-3',
'商品画像9-4',
'商品画像9-5',
'価格9',
'価格コメント9',
'おすすめ商品の設定9',
'商品タイプ10',
'商品名10 / カテゴリ名10',
'商品紹介10/ カテゴリ紹介10',
'商品画像10-1',
'商品画像10-2',
'商品画像10-3',
'商品画像10-4',
'商品画像10-5',
'価格10',
'価格コメント10',
'おすすめ商品の設定10',
'商品タイプ11',
'商品名11 / カテゴリ名11',
'商品紹介11/ カテゴリ紹介11',
'商品画像11-1',
'商品画像11-2',
'商品画像11-3',
'商品画像11-4',
'商品画像11-5',
'価格11',
'価格コメント11',
'おすすめ商品の設定11',
'商品タイプ12',
'商品名12 / カテゴリ名12',
'商品紹介12/ カテゴリ紹介12',
'商品画像12-1',
'商品画像12-2',
'商品画像12-3',
'商品画像12-4',
'商品画像12-5',
'価格12',
'価格コメント12',
'おすすめ商品の設定12',
'商品タイプ13',
'商品名13 / カテゴリ名13',
'商品紹介13/ カテゴリ紹介13',
'商品画像13-1',
'商品画像13-2',
'商品画像13-3',
'商品画像13-4',
'商品画像13-5',
'価格13',
'価格コメント13',
'おすすめ商品の設定13',
'商品タイプ14',
'商品名14 / カテゴリ名14',
'商品紹介14/ カテゴリ紹介14',
'商品画像14-1',
'商品画像14-2',
'商品画像14-3',
'商品画像14-4',
'商品画像14-5',
'価格14',
'価格コメント14',
'おすすめ商品の設定14',
'商品タイプ15',
'商品名15 / カテゴリ名15',
'商品紹介15/ カテゴリ紹介15',
'商品画像15-1',
'商品画像15-2',
'商品画像15-3',
'商品画像15-4',
'商品画像15-5',
'価格15',
'価格コメント15',
'おすすめ商品の設定15',
'商品タイプ16',
'商品名16 / カテゴリ名16',
'商品紹介16/ カテゴリ紹介16',
'商品画像16-1',
'商品画像16-2',
'商品画像16-3',
'商品画像16-4',
'商品画像16-5',
'価格16',
'価格コメント16',
'おすすめ商品の設定16',
'商品タイプ17',
'商品名17 / カテゴリ名17',
'商品紹介17/ カテゴリ紹介17',
'商品画像17-1',
'商品画像17-2',
'商品画像17-3',
'商品画像17-4',
'商品画像17-5',
'価格17',
'価格コメント17',
'おすすめ商品の設定17',
'商品タイプ18',
'商品名18 / カテゴリ名18',
'商品紹介18/ カテゴリ紹介18',
'商品画像18-1',
'商品画像18-2',
'商品画像18-3',
'商品画像18-4',
'商品画像18-5',
'価格18',
'価格コメント18',
'おすすめ商品の設定18',
'商品タイプ19',
'商品名19 / カテゴリ名19',
'商品紹介19/ カテゴリ紹介19',
'商品画像19-1',
'商品画像19-2',
'商品画像19-3',
'商品画像19-4',
'商品画像19-5',
'価格19',
'価格コメント19',
'おすすめ商品の設定19',
'商品タイプ20',
'商品名20 / カテゴリ名20',
'商品紹介20/ カテゴリ紹介20',
'商品画像20-1',
'商品画像20-2',
'商品画像20-3',
'商品画像20-4',
'商品画像20-5',
'価格20',
'価格コメント20',
'おすすめ商品の設定20',
'クーポンページ公開/非公開',
'クーポンページ名',
'クーポンタイトル1',
'クーポン情報1',
'利用期間設定1',
'利用期間設定 開始日1',
'利用期間設定 終了日1',
'携帯電話での表示1',
'システム仕様',
'クーポンタイトル2',
'クーポン情報2',
'利用期間設定2',
'利用期間設定 開始日2',
'利用期間設定 終了日2',
'携帯電話での表示2',
'システム仕様',
'クーポンタイトル3',
'クーポン情報3',
'利用期間設定3',
'利用期間設定 開始日3',
'利用期間設定 終了日3',
'携帯電話での表示3',
'システム仕様',
'クーポンタイトル4',
'クーポン情報4',
'利用期間設定4',
'利用期間設定 開始日4',
'利用期間設定 終了日4',
'携帯電話での表示4',
'システム仕様',
'クーポンの提示方法',
'写真ページ公開/非公開',
'写真ページ名',
'画像1',
'画像説明1',
'画像のカテゴリ1',
'画像2',
'画像説明2',
'画像のカテゴリ2',
'画像3',
'画像説明3',
'画像のカテゴリ3',
'画像4',
'画像説明4',
'画像のカテゴリ4',
'画像5',
'画像説明5',
'画像のカテゴリ5',
'画像6',
'画像説明6',
'画像のカテゴリ6',
'画像7',
'画像説明7',
'画像のカテゴリ7',
'画像8',
'画像説明8',
'画像のカテゴリ8',
'画像9',
'画像説明9',
'画像のカテゴリ9',
'画像10',
'画像説明10',
'画像のカテゴリ10',
'画像11',
'画像説明11',
'画像のカテゴリ11',
'画像12',
'画像説明12',
'画像のカテゴリ12',
'画像13',
'画像説明13',
'画像のカテゴリ13',
'画像14',
'画像説明14',
'画像のカテゴリ14',
'画像15',
'画像説明15',
'画像のカテゴリ15',
'画像16',
'画像説明16',
'画像のカテゴリ16',
'画像17',
'画像説明17',
'画像のカテゴリ17',
'画像18',
'画像説明18',
'画像のカテゴリ18',
'画像19',
'画像説明19',
'画像のカテゴリ19',
'画像20',
'画像説明20',
'画像のカテゴリ20',
'画像21',
'画像説明21',
'画像のカテゴリ21',
'画像22',
'画像説明22',
'画像のカテゴリ22',
'画像23',
'画像説明23',
'画像のカテゴリ23',
'画像24',
'画像説明24',
'画像のカテゴリ24',
'画像25',
'画像説明25',
'画像のカテゴリ25',
'画像26',
'画像説明26',
'画像のカテゴリ26',
'画像27',
'画像説明27',
'画像のカテゴリ27',
'画像28',
'画像説明28',
'画像のカテゴリ28',
'画像29',
'画像説明29',
'画像のカテゴリ29',
'画像30',
'画像説明30',
'画像のカテゴリ30',
'フリーページ公開/非公開',
'フリーページ名',
'項目の構成1',
'項目の見出し1',
'本文1',
'画像1',
'動画1　（YouTubeのURL)',
'項目の構成2',
'項目の見出し2',
'本文2',
'画像2',
'動画2　（YouTubeのURL)',
'項目の構成3',
'項目の見出し3',
'本文3',
'画像3',
'動画3　（YouTubeのURL)',
'項目の構成4',
'項目の見出し4',
'本文4',
'画像4',
'動画4　（YouTubeのURL)',
'項目の構成5',
'項目の見出し5',
'本文5',
'画像5',
'動画5　（YouTubeのURL)',
'項目の構成6',
'項目の見出し6',
'本文6',
'画像6',
'動画6　（YouTubeのURL)',
'項目の構成7',
'項目の見出し7',
'本文7',
'画像7',
'動画7　（YouTubeのURL)',
'項目の構成8',
'項目の見出し8',
'本文8',
'画像8',
'動画8　（YouTubeのURL)',
'項目の構成9',
'項目の見出し9',
'本文9',
'画像9',
'動画9　（YouTubeのURL)',
'項目の構成10',
'項目の見出し10',
'本文10',
'画像10',
'動画10　（YouTubeのURL)',
'アクセスページ公開/非公開',
'アクセスページ名',
'最寄駅1 駅名',
'最寄駅1 路線名',
'最寄駅2 駅名',
'最寄駅2 路線名',
'その他店舗/施設への行き方について',
'駐車場の有無',
'駐車場に関するコメント',
'ジャンル1',
'ジャンル2',
'利用シーン',
'ランチの平均予算',
'ディナーの平均予算',
'営業時間（ランチ／平日）開始',
'営業時間（ランチ／平日）終了',
'ラストオーダー（ランチ／平日）',
'営業時間（ディナー／平日）開始',
'営業時間（ディナー／平日）終了',
'ラストオーダー（ディナー／平日）',
'営業時間（ランチ／休日）開始',
'営業時間（ランチ／休日）終了',
'ラストオーダー（ランチ／休日）',
'営業時間（ディナー／休日）開始',
'営業時間（ディナー／休日）終了',
'ラストオーダー（ディナー／休日）',
'飲み放題付きコース',
'食べ放題メニュー',
'コースメニュー',
'ドリンク',
'個室',
'ランチタイム',
'ラストオーダー',
'テイクアウト',
'システム仕様',
'記念日対応',
'開店日',
'改装日',
'ロケーション',
'空間・設備',
'サービス',
'システム仕様',
'システム仕様',
'システム仕様',
'システム仕様',
'システム仕様',
'システム仕様',
'システム仕様',
'システム仕様',
'検索一覧用画像',
'管理用項目',
'システム設置値１',
'システム設置値２',
'システム設置値３',
);

$nyukoMessage = array(
	'0' => '処理を受け付けました',
	'1' => 'ファイルがアップロードされていません',
	'2' => 'アップロードされたファイルをオープンできません',
	'3' => 'tsvファイルではありません',
	'4' => 'tsv最初の3行が不正です',
	'5' => 'tsvのフォーマットが不正です',
	'6' => 'tsvファイルをアップロードできませんでした',
	'7' => 'アップロードされたファイルがZIPファイルではありません',
	'8' => 'zipファイルをアップロードできませんでした',
);

$yahoo_category['0101011'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101001'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101002'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101004'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101003'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0114003'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101005'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101006'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101007'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101032'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101033'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0109001'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101044'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101045'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101050'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101051'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101052'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101008'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101009'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101010'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101012'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101013'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101014'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101026'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101028'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101029'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101030'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101031'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101048'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0103001'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101053'] = array( 'head' => '0001' , 'sub' => '0001');
$yahoo_category['0101034'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0109001'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101044'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101012'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101013'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101035'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101036'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101037'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101038'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101049'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101039'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101040'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101023'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0101024'] = array( 'head' => '0001' , 'sub' => '0002');
$yahoo_category['0109001'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101044'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101045'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101026'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101027'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101041'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101042'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101043'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101046'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101047'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101021'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101022'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101025'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101015'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0101016'] = array( 'head' => '0001' , 'sub' => '0003');
$yahoo_category['0102005'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102006'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102007'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102008'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102009'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102010'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102011'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102012'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102013'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102014'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102015'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102016'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102017'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102018'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102019'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102020'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102001'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102002'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102003'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102004'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102021'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0102022'] = array( 'head' => '0001' , 'sub' => '0004');
$yahoo_category['0104001'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0104002'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0104003'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0104004'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0104005'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0104006'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0104007'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0109001'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0104008'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0104009'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0106001'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0106002'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0103001'] = array( 'head' => '0001' , 'sub' => '0005');
$yahoo_category['0105001'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105003'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105006'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105004'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105005'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105007'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105008'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105009'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105010'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105011'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105012'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105013'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105002'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0109001'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0107004'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0107005'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0105014'] = array( 'head' => '0001' , 'sub' => '0006');
$yahoo_category['0110001'] = array( 'head' => '0001' , 'sub' => '0007');
$yahoo_category['0110002'] = array( 'head' => '0001' , 'sub' => '0007');
$yahoo_category['0110003'] = array( 'head' => '0001' , 'sub' => '0007');
$yahoo_category['0110004'] = array( 'head' => '0001' , 'sub' => '0007');
$yahoo_category['0110005'] = array( 'head' => '0001' , 'sub' => '0007');
$yahoo_category['0110006'] = array( 'head' => '0001' , 'sub' => '0007');
$yahoo_category['0122001'] = array( 'head' => '0001' , 'sub' => '0007');
$yahoo_category['0109001'] = array( 'head' => '0001' , 'sub' => '0007');
$yahoo_category['0112001'] = array( 'head' => '0001' , 'sub' => '0080');
$yahoo_category['0112002'] = array( 'head' => '0001' , 'sub' => '0080');
$yahoo_category['0123001'] = array( 'head' => '0001' , 'sub' => '0008');
$yahoo_category['0123002'] = array( 'head' => '0001' , 'sub' => '0008');
$yahoo_category['0123003'] = array( 'head' => '0001' , 'sub' => '0008');
$yahoo_category['0107001'] = array( 'head' => '0001' , 'sub' => '0009');
$yahoo_category['0107004'] = array( 'head' => '0001' , 'sub' => '0009');
$yahoo_category['0107005'] = array( 'head' => '0001' , 'sub' => '0009');
$yahoo_category['0107002'] = array( 'head' => '0001' , 'sub' => '0009');
$yahoo_category['0107003'] = array( 'head' => '0001' , 'sub' => '0009');
$yahoo_category['0108001'] = array( 'head' => '0001' , 'sub' => '0010');
$yahoo_category['0108003'] = array( 'head' => '0001' , 'sub' => '0010');
$yahoo_category['0108002'] = array( 'head' => '0001' , 'sub' => '0010');
$yahoo_category['0111001'] = array( 'head' => '0001' , 'sub' => '0011');
$yahoo_category['0113001'] = array( 'head' => '0001' , 'sub' => '0012');
$yahoo_category['0113002'] = array( 'head' => '0001' , 'sub' => '0012');
$yahoo_category['0113003'] = array( 'head' => '0001' , 'sub' => '0012');
$yahoo_category['0115002'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115013'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115012'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115001'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115003'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115005'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115006'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115004'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115011'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115007'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115009'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115008'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115010'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0115014'] = array( 'head' => '0001' , 'sub' => '0013');
$yahoo_category['0116001'] = array( 'head' => '0001' , 'sub' => '0014');
$yahoo_category['0116002'] = array( 'head' => '0001' , 'sub' => '0014');
$yahoo_category['0116003'] = array( 'head' => '0001' , 'sub' => '0014');
$yahoo_category['0116004'] = array( 'head' => '0001' , 'sub' => '0014');
$yahoo_category['0117001'] = array( 'head' => '0001' , 'sub' => '0015');
$yahoo_category['0117002'] = array( 'head' => '0001' , 'sub' => '0015');
$yahoo_category['0117003'] = array( 'head' => '0001' , 'sub' => '0015');
$yahoo_category['0117004'] = array( 'head' => '0001' , 'sub' => '0015');
$yahoo_category['0117005'] = array( 'head' => '0001' , 'sub' => '0015');
$yahoo_category['0118001'] = array( 'head' => '0001' , 'sub' => '0016');
$yahoo_category['0118002'] = array( 'head' => '0001' , 'sub' => '0016');
$yahoo_category['0118003'] = array( 'head' => '0001' , 'sub' => '0016');
$yahoo_category['0118004'] = array( 'head' => '0001' , 'sub' => '0016');
$yahoo_category['0119001'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119002'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119004'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119009'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119005'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119006'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119007'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119008'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119010'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119011'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0119003'] = array( 'head' => '0001' , 'sub' => '0017');
$yahoo_category['0114001'] = array( 'head' => '0001' , 'sub' => '0018');
$yahoo_category['0114002'] = array( 'head' => '0001' , 'sub' => '0018');
$yahoo_category['0114003'] = array( 'head' => '0001' , 'sub' => '0018');
$yahoo_category['0101017'] = array( 'head' => '0001' , 'sub' => '0019');
$yahoo_category['0101018'] = array( 'head' => '0001' , 'sub' => '0019');
$yahoo_category['0101019'] = array( 'head' => '0001' , 'sub' => '0019');
$yahoo_category['0101020'] = array( 'head' => '0001' , 'sub' => '0019');
$yahoo_category['0120001'] = array( 'head' => '0001' , 'sub' => '0020');
$yahoo_category['0120002'] = array( 'head' => '0001' , 'sub' => '0020');
$yahoo_category['0120003'] = array( 'head' => '0001' , 'sub' => '0020');
$yahoo_category['0120004'] = array( 'head' => '0001' , 'sub' => '0020');
$yahoo_category['0121001'] = array( 'head' => '0001' , 'sub' => '0021');
$yahoo_category['0121002'] = array( 'head' => '0001' , 'sub' => '0021');
$yahoo_category['0124001'] = array( 'head' => '0001' , 'sub' => '0022');
$yahoo_category['0124002'] = array( 'head' => '0001' , 'sub' => '0022');
$yahoo_category['0115014'] = array( 'head' => '0001' , 'sub' => '0022');
$yahoo_category['0125001'] = array( 'head' => '0001' , 'sub' => '0023');
$yahoo_category['0125002'] = array( 'head' => '0001' , 'sub' => '0023');
$yahoo_category['0126001'] = array( 'head' => '0001' , 'sub' => '0024');
$yahoo_category['0126002'] = array( 'head' => '0001' , 'sub' => '0024');
$yahoo_category['0127001'] = array( 'head' => '0001' , 'sub' => '0025');

#グルメ以外
$yahoo_category['0201001'] = array( 'head' => '0002' , 'sub' => '0026');
$yahoo_category['0202001'] = array( 'head' => '0002' , 'sub' => '0027');
$yahoo_category['0202002'] = array( 'head' => '0002' , 'sub' => '0027');
$yahoo_category['0202003'] = array( 'head' => '0002' , 'sub' => '0027');
$yahoo_category['0202004'] = array( 'head' => '0002' , 'sub' => '0027');
$yahoo_category['0202005'] = array( 'head' => '0002' , 'sub' => '0027');
$yahoo_category['0203002'] = array( 'head' => '0002' , 'sub' => '0028');
$yahoo_category['0203001'] = array( 'head' => '0002' , 'sub' => '0028');
$yahoo_category['0203004'] = array( 'head' => '0002' , 'sub' => '0028');
$yahoo_category['0203003'] = array( 'head' => '0002' , 'sub' => '0028');
$yahoo_category['0204001'] = array( 'head' => '0002' , 'sub' => '0029');
$yahoo_category['0204002'] = array( 'head' => '0002' , 'sub' => '0029');
$yahoo_category['0204003'] = array( 'head' => '0002' , 'sub' => '0029');
$yahoo_category['0204004'] = array( 'head' => '0002' , 'sub' => '0029');
$yahoo_category['0204005'] = array( 'head' => '0002' , 'sub' => '0029');
$yahoo_category['0205001'] = array( 'head' => '0002' , 'sub' => '0030');
$yahoo_category['0205002'] = array( 'head' => '0002' , 'sub' => '0030');
$yahoo_category['0206001'] = array( 'head' => '0002' , 'sub' => '0031');
$yahoo_category['0206002'] = array( 'head' => '0002' , 'sub' => '0031');
$yahoo_category['0206003'] = array( 'head' => '0002' , 'sub' => '0031');
$yahoo_category['0207004'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207005'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207001'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207002'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207003'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207006'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207007'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207008'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207009'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0417003'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0408010'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0408009'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0207010'] = array( 'head' => '0002' , 'sub' => '0032');
$yahoo_category['0208001'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0208002'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0115010'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0208003'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0208004'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0405024'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0405025'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0405026'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0405029'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0405030'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0413013'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0417003'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0208008'] = array( 'head' => '0002' , 'sub' => '0033');
$yahoo_category['0208005'] = array( 'head' => '0002' , 'sub' => '0034');
$yahoo_category['0208006'] = array( 'head' => '0002' , 'sub' => '0034');
$yahoo_category['0416007'] = array( 'head' => '0002' , 'sub' => '0034');
$yahoo_category['0208007'] = array( 'head' => '0002' , 'sub' => '0034');
$yahoo_category['0301008'] = array( 'head' => '0002' , 'sub' => '0034');
$yahoo_category['0301009'] = array( 'head' => '0002' , 'sub' => '0034');
$yahoo_category['0301012'] = array( 'head' => '0002' , 'sub' => '0034');
$yahoo_category['0208008'] = array( 'head' => '0002' , 'sub' => '0034');
$yahoo_category['0209001'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209002'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209004'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209003'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209009'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209011'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209005'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209006'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209007'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209008'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209010'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209012'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209013'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209015'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209016'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209017'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209014'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0209018'] = array( 'head' => '0002' , 'sub' => '0035');
$yahoo_category['0210001'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210002'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210003'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210004'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210005'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210012'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210007'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210010'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210011'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210008'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210006'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210009'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0210013'] = array( 'head' => '0002' , 'sub' => '0036');
$yahoo_category['0211001'] = array( 'head' => '0002' , 'sub' => '0037');
$yahoo_category['0407008'] = array( 'head' => '0002' , 'sub' => '0037');
$yahoo_category['0301001'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301002'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301003'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301004'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301005'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301006'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301007'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301008'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301009'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301010'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301011'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301012'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0301013'] = array( 'head' => '0003' , 'sub' => '0038');
$yahoo_category['0302002'] = array( 'head' => '0003' , 'sub' => '0039');
$yahoo_category['0302003'] = array( 'head' => '0003' , 'sub' => '0039');
$yahoo_category['0115004'] = array( 'head' => '0003' , 'sub' => '0039');
$yahoo_category['0115007'] = array( 'head' => '0003' , 'sub' => '0039');
$yahoo_category['0115008'] = array( 'head' => '0003' , 'sub' => '0039');
$yahoo_category['0115011'] = array( 'head' => '0003' , 'sub' => '0039');
$yahoo_category['0303001'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303002'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303003'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303004'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303007'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303006'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303005'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303010'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303008'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0125001'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0125002'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303009'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303011'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303012'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0301007'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0126001'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0126002'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0303013'] = array( 'head' => '0003' , 'sub' => '0040');
$yahoo_category['0405001'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405002'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405004'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405005'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405006'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405007'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405008'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405010'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405011'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405012'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405013'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405009'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405015'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405016'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405017'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405018'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405019'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405020'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405021'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405022'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405023'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405031'] = array( 'head' => '0003' , 'sub' => '0041');
$yahoo_category['0405001'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405003'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405024'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405025'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405026'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405027'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405028'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405029'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405030'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0405031'] = array( 'head' => '0003' , 'sub' => '0042');
$yahoo_category['0305001'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0305002'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0305003'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0305007'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0305004'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0305005'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0305006'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0115009'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0124001'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0124002'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0115014'] = array( 'head' => '0004' , 'sub' => '0043');
$yahoo_category['0306001'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0306004'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0306002'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0306003'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0306006'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0306007'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0306008'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0411001'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0411002'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0412005'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0412021'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0306005'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0413007'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0306009'] = array( 'head' => '0005' , 'sub' => '0044');
$yahoo_category['0307001'] = array( 'head' => '0006' , 'sub' => '0045');
$yahoo_category['0307002'] = array( 'head' => '0006' , 'sub' => '0045');
$yahoo_category['0307003'] = array( 'head' => '0006' , 'sub' => '0045');
$yahoo_category['0307004'] = array( 'head' => '0006' , 'sub' => '0045');
$yahoo_category['0307005'] = array( 'head' => '0006' , 'sub' => '0045');
$yahoo_category['0307006'] = array( 'head' => '0006' , 'sub' => '0045');
$yahoo_category['0304001'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304002'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304003'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304004'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304005'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304006'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304007'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304008'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304009'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0127001'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0304010'] = array( 'head' => '0006' , 'sub' => '0046');
$yahoo_category['0401001'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401002'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401003'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401004'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401005'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401006'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401007'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401008'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401009'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401010'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401011'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401012'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401013'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401014'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401015'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401016'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401017'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401018'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401019'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401020'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401021'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401022'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401023'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401024'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401025'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401026'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401027'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401028'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401029'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401030'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401031'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401032'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401033'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401034'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401035'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401036'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401037'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401038'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401039'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401040'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401041'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401042'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401043'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401044'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401045'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401046'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401047'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401048'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0401049'] = array( 'head' => '0007' , 'sub' => '0047');
$yahoo_category['0402001'] = array( 'head' => '0007' , 'sub' => '0048');
$yahoo_category['0202002'] = array( 'head' => '0007' , 'sub' => '0048');
$yahoo_category['0202003'] = array( 'head' => '0007' , 'sub' => '0048');
$yahoo_category['0202004'] = array( 'head' => '0007' , 'sub' => '0048');
$yahoo_category['0403001'] = array( 'head' => '0007' , 'sub' => '0049');
$yahoo_category['0403002'] = array( 'head' => '0007' , 'sub' => '0049');
$yahoo_category['0403003'] = array( 'head' => '0007' , 'sub' => '0049');
$yahoo_category['0403004'] = array( 'head' => '0007' , 'sub' => '0049');
$yahoo_category['0403005'] = array( 'head' => '0007' , 'sub' => '0049');
$yahoo_category['0403006'] = array( 'head' => '0007' , 'sub' => '0049');
$yahoo_category['0404001'] = array( 'head' => '0007' , 'sub' => '0050');
$yahoo_category['0404002'] = array( 'head' => '0007' , 'sub' => '0050');
$yahoo_category['0404003'] = array( 'head' => '0007' , 'sub' => '0050');
$yahoo_category['0404004'] = array( 'head' => '0007' , 'sub' => '0050');
$yahoo_category['0404005'] = array( 'head' => '0007' , 'sub' => '0050');
$yahoo_category['0404006'] = array( 'head' => '0007' , 'sub' => '0050');
$yahoo_category['0412017'] = array( 'head' => '0008' , 'sub' => '0051');
$yahoo_category['0306002'] = array( 'head' => '0008' , 'sub' => '0051');
$yahoo_category['0412030'] = array( 'head' => '0008' , 'sub' => '0051');
$yahoo_category['0301012'] = array( 'head' => '0008' , 'sub' => '0051');
$yahoo_category['0412020'] = array( 'head' => '0008' , 'sub' => '0051');
$yahoo_category['0412018'] = array( 'head' => '0008' , 'sub' => '0051');
$yahoo_category['0417001'] = array( 'head' => '0008' , 'sub' => '0052');
$yahoo_category['0417002'] = array( 'head' => '0008' , 'sub' => '0052');
$yahoo_category['0417003'] = array( 'head' => '0008' , 'sub' => '0052');
$yahoo_category['0417004'] = array( 'head' => '0008' , 'sub' => '0052');
$yahoo_category['0417005'] = array( 'head' => '0008' , 'sub' => '0052');
$yahoo_category['0417006'] = array( 'head' => '0008' , 'sub' => '0052');
$yahoo_category['0417007'] = array( 'head' => '0008' , 'sub' => '0052');
$yahoo_category['0418001'] = array( 'head' => '0008' , 'sub' => '0053');
$yahoo_category['0418002'] = array( 'head' => '0008' , 'sub' => '0053');
$yahoo_category['0418003'] = array( 'head' => '0008' , 'sub' => '0053');
$yahoo_category['0418004'] = array( 'head' => '0008' , 'sub' => '0053');
$yahoo_category['0418005'] = array( 'head' => '0008' , 'sub' => '0053');
$yahoo_category['0418006'] = array( 'head' => '0008' , 'sub' => '0053');
$yahoo_category['0419001'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419002'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419003'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419004'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419005'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419006'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419007'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419008'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419009'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419010'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419011'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419012'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419013'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0419014'] = array( 'head' => '0008' , 'sub' => '0054');
$yahoo_category['0412004'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412023'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412024'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412005'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412006'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412031'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412016'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412022'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412026'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412027'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412010'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412009'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412015'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412007'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412013'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412011'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412025'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412012'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412014'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412008'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0411002'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412028'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412029'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0420012'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412032'] = array( 'head' => '0008' , 'sub' => '0055');
$yahoo_category['0412001'] = array( 'head' => '0008' , 'sub' => '0056');
$yahoo_category['0412002'] = array( 'head' => '0008' , 'sub' => '0056');
$yahoo_category['0412003'] = array( 'head' => '0008' , 'sub' => '0056');
$yahoo_category['0412019'] = array( 'head' => '0008' , 'sub' => '0056');
$yahoo_category['0406001'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406002'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406003'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406004'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406005'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406006'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406007'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406008'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406009'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406010'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0406011'] = array( 'head' => '0009' , 'sub' => '0057');
$yahoo_category['0407001'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407002'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407003'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407004'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407005'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407006'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407007'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407008'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407009'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0407010'] = array( 'head' => '0009' , 'sub' => '0058');
$yahoo_category['0408001'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408002'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408003'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408004'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408005'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408006'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408007'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408008'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408009'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408010'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0408011'] = array( 'head' => '0009' , 'sub' => '0059');
$yahoo_category['0410003'] = array( 'head' => '0010' , 'sub' => '0060');
$yahoo_category['0410004'] = array( 'head' => '0010' , 'sub' => '0060');
$yahoo_category['0410005'] = array( 'head' => '0010' , 'sub' => '0060');
$yahoo_category['0410006'] = array( 'head' => '0010' , 'sub' => '0060');
$yahoo_category['0413010'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413011'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413012'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413015'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413001'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413016'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413002'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413013'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413014'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413005'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413003'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413004'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413006'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413007'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413008'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413009'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0306002'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0413017'] = array( 'head' => '0011' , 'sub' => '0061');
$yahoo_category['0414001'] = array( 'head' => '0012' , 'sub' => '0062');
$yahoo_category['0414002'] = array( 'head' => '0012' , 'sub' => '0062');
$yahoo_category['0414003'] = array( 'head' => '0012' , 'sub' => '0062');
$yahoo_category['0415001'] = array( 'head' => '0012' , 'sub' => '0063');
$yahoo_category['0415002'] = array( 'head' => '0012' , 'sub' => '0063');
$yahoo_category['0415003'] = array( 'head' => '0012' , 'sub' => '0063');
$yahoo_category['0415004'] = array( 'head' => '0012' , 'sub' => '0063');
$yahoo_category['0415005'] = array( 'head' => '0012' , 'sub' => '0063');
$yahoo_category['0416001'] = array( 'head' => '0013' , 'sub' => '0064');
$yahoo_category['0416002'] = array( 'head' => '0013' , 'sub' => '0064');
$yahoo_category['0416003'] = array( 'head' => '0013' , 'sub' => '0064');
$yahoo_category['0416004'] = array( 'head' => '0013' , 'sub' => '0064');
$yahoo_category['0416005'] = array( 'head' => '0013' , 'sub' => '0064');
$yahoo_category['0416006'] = array( 'head' => '0013' , 'sub' => '0064');
$yahoo_category['0416007'] = array( 'head' => '0013' , 'sub' => '0064');
$yahoo_category['0416008'] = array( 'head' => '0013' , 'sub' => '0064');
$yahoo_category['0422001'] = array( 'head' => '0014' , 'sub' => '0065');
$yahoo_category['0422002'] = array( 'head' => '0014' , 'sub' => '0065');
$yahoo_category['0422003'] = array( 'head' => '0014' , 'sub' => '0065');
$yahoo_category['0422004'] = array( 'head' => '0014' , 'sub' => '0065');
$yahoo_category['0423001'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0423002'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0423003'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0423004'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0423005'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0423006'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0423007'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0423008'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0423009'] = array( 'head' => '0014' , 'sub' => '0066');
$yahoo_category['0424001'] = array( 'head' => '0015' , 'sub' => '0067');
$yahoo_category['0424002'] = array( 'head' => '0015' , 'sub' => '0067');
$yahoo_category['0424003'] = array( 'head' => '0015' , 'sub' => '0067');
$yahoo_category['0424004'] = array( 'head' => '0015' , 'sub' => '0067');
$yahoo_category['0501001'] = array( 'head' => '0016' , 'sub' => '0068');
$yahoo_category['0501002'] = array( 'head' => '0016' , 'sub' => '0068');
$yahoo_category['0501003'] = array( 'head' => '0016' , 'sub' => '0068');
$yahoo_category['0501004'] = array( 'head' => '0016' , 'sub' => '0068');
$yahoo_category['0501005'] = array( 'head' => '0016' , 'sub' => '0068');
$yahoo_category['0501006'] = array( 'head' => '0016' , 'sub' => '0068');
$yahoo_category['0501007'] = array( 'head' => '0016' , 'sub' => '0068');
$yahoo_category['0501008'] = array( 'head' => '0016' , 'sub' => '0068');
$yahoo_category['0502001'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502002'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502003'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502004'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502005'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502006'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0420011'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502009'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502010'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502011'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502012'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502013'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0502014'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0420009'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0420010'] = array( 'head' => '0016' , 'sub' => '0069');
$yahoo_category['0503001'] = array( 'head' => '0016' , 'sub' => '0070');
$yahoo_category['0503003'] = array( 'head' => '0016' , 'sub' => '0070');
$yahoo_category['0504001'] = array( 'head' => '0016' , 'sub' => '0071');
$yahoo_category['0504002'] = array( 'head' => '0016' , 'sub' => '0071');
$yahoo_category['0504003'] = array( 'head' => '0016' , 'sub' => '0071');
$yahoo_category['0505001'] = array( 'head' => '0016' , 'sub' => '0072');
$yahoo_category['0505002'] = array( 'head' => '0016' , 'sub' => '0072');
$yahoo_category['0505003'] = array( 'head' => '0016' , 'sub' => '0072');
$yahoo_category['0505004'] = array( 'head' => '0016' , 'sub' => '0072');
$yahoo_category['0505005'] = array( 'head' => '0016' , 'sub' => '0072');
$yahoo_category['0505006'] = array( 'head' => '0016' , 'sub' => '0072');
$yahoo_category['0506001'] = array( 'head' => '0016' , 'sub' => '0073');
$yahoo_category['0506002'] = array( 'head' => '0016' , 'sub' => '0073');
$yahoo_category['0506003'] = array( 'head' => '0016' , 'sub' => '0073');
$yahoo_category['0506004'] = array( 'head' => '0016' , 'sub' => '0073');
$yahoo_category['0506005'] = array( 'head' => '0016' , 'sub' => '0073');
$yahoo_category['0506006'] = array( 'head' => '0016' , 'sub' => '0073');
$yahoo_category['0507001'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507002'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507003'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507004'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507005'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507006'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507007'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507008'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507009'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507010'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507011'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507012'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507013'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0507014'] = array( 'head' => '0016' , 'sub' => '0074');
$yahoo_category['0508001'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508002'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508003'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508004'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508005'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508006'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508007'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508008'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508009'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508010'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508011'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508012'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508013'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508014'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508015'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508016'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508017'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0508018'] = array( 'head' => '0016' , 'sub' => '0075');
$yahoo_category['0509001'] = array( 'head' => '0016' , 'sub' => '0076');
$yahoo_category['0509002'] = array( 'head' => '0016' , 'sub' => '0076');
$yahoo_category['0509003'] = array( 'head' => '0016' , 'sub' => '0076');
$yahoo_category['0510001'] = array( 'head' => '0016' , 'sub' => '0077');
$yahoo_category['0510002'] = array( 'head' => '0016' , 'sub' => '0077');
$yahoo_category['0510003'] = array( 'head' => '0016' , 'sub' => '0077');
$yahoo_category['0510004'] = array( 'head' => '0016' , 'sub' => '0077');
$yahoo_category['0510005'] = array( 'head' => '0016' , 'sub' => '0077');
$yahoo_category['0510006'] = array( 'head' => '0016' , 'sub' => '0077');
$yahoo_category['0510007'] = array( 'head' => '0016' , 'sub' => '0077');
$yahoo_category['0511001'] = array( 'head' => '0016' , 'sub' => '0078');
$yahoo_category['0502007'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420005'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420002'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420003'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420004'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420001'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420006'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420007'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420008'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0502008'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0420013'] = array( 'head' => '0016' , 'sub' => '0079');
$yahoo_category['0308001'] = array( 'head' => '8888' , 'sub' => '8888');


$templateEntry = array(
	'1' => '1',
	'5' => '2',
	'9' => '3',
	'241' => '99',
	'246' => '100',
	'251' => '101',
	'49' => '13',
	'53' => '14',
	'57' => '15',
	'61' => '16',
	'65' => '17',
	'69' => '18',
	'25' => '7',
	'29' => '8',
	'33' => '9',
	
	'13' => '4',
	'17' => '5',
	'21' => '6',
	'37' => '10',
	'41' => '11',
	'45' => '12',
	'73' => '19',
	'77' => '20',
	'81' => '21',
	'85' => '22',
	'89' => '23',
	'93' => '24',
	'97' => '25',
	'101' => '26',
	'105' => '27',
	
	'109' => '28',
	'113' => '29',
	'117' => '30',
	
);
	
$templateStandard = array(
	'2' => '1',
	'6' => '2',
	'10' => '3',
	'242' => '99',
	'247' => '100',
	'252' => '101',
	'50' => '13',
	'54' => '14',
	'58' => '15',
	'62' => '16',
	'66' => '17',
	'70' => '18',
	'26' => '7',
	'30' => '8',
	'34' => '9',
	
	'14' => '4',
	'18' => '5',
	'22' => '6',
	'38' => '10',
	'42' => '11',
	'46' => '12',
	'74' => '19',
	'78' => '20',
	'82' => '21',
	'86' => '22',
	'90' => '23',
	'94' => '24',
	'98' => '25',
	'102' => '26',
	'106' => '27',	
	
	'110' => '28',
	'114' => '29',
	'118' => '30',
	'121' => '31',
	'123' => '32',
	'125' => '33',
	'127' => '34',
	'129' => '35',
	'131' => '36',
	'133' => '37',
	'135' => '71',
	'137' => '40',
	'139' => '41',
	'141' => '42',
	'143' => '43',
	
	'145' => '44',
	'147' => '46',
	'149' => '45',
	'151' => '47',
	'153' => '48',
	'155' => '49',
	'157' => '50',
	'159' => '51',
	'161' => '52',
	'163' => '53',
	'165' => '54',
	'167' => '56',
	'169' => '57',
	'171' => '59',
	'173' => '62',

	'175' => '63',
	'177' => '66',
	'179' => '67',
	'256' => '85',
	'259' => '93',
	'262' => '102',
	'265' => '103',
	'268' => '104',
	'271' => '105',
	'274' => '106',
	'277' => '107',
	'280' => '108',
	'283' => '109',
	'286' => '110',
	'289' => '111',
);
?>